---
kind: other
id: Methods.T:Autodesk.Revit.DB.LightNode
source: html/e51c6560-7011-23f3-1832-97033f05cd8c.htm
---
# LightNode Methods

Returns an an instance of an Asset object, which contains definitions of the content node.